Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/RTC_old/RTC_old.tmx
Source language: en_us
Languages: de_de

source: a first spool (16) comprising a first compressor (24) and a first turbine (26) mounted to a first shaft (28);
de_de: eine erste Spule (16), die einen ersten Verdichter (24) und eine erste Turbine (26) umfasst, die an einer ersten Welle (28) montiert sind;

source: a second spool (12) comprising a second compressor (74) and a second turbine (82) mounted to a second shaft (76);
de_de: eine zweite Spule (12), die einen zweiten Verdichter (74) und eine zweite Turbine (82) umfasst, die an einer zweiten Welle (76) montiert sind;

source: a third spool (14) comprising a third compressor (18) and a third turbine (20) mounted to a third shaft (22);
de_de: eine dritte Spule (14), die einen dritten Verdichter (18) und eine dritte Turbine (20) umfasst, die an einer dritten Welle (22) montiert sind;

source: an accessory gearbox (232) comprising a first gearing (224, 226) and a second gearing (210, 212) enclosed within a housing (230), wherein the first gearing (224, 226) rotates independently of the second gearing (210, 212); and
de_de: ein Nebengetriebe (232), das ein erstes Getriebe (224, 226) und ein zweites Getriebe (210, 212) umfasst, die in einem Gehäuse (230) eingeschlossen sind, wobei sich das erste Getriebe (224, 226) unabhängig vom zweiten Getriebe (210, 212) dreht; und

source: a plurality of engine accessories, wherein the first spool (16) is rotationally coupled to the plurality of engine accessories via the first gearing (224, 226), and the third spool (14) is rotationally coupled to the second spool (12) via the second gearing (210, 212).
de_de: eine Vielzahl von Triebwerkzubehörteilen, wobei die erste Spule (16) über das erste Getriebe (224, 226) drehfest mit der Vielzahl von Triebwerkzubehörteilen gekoppelt ist und die dritte Spule (14) über das zweite Getriebe (210, 212) drehfest mit der zweiten Spule (12) gekoppelt ist.

source: 2. The gas turbine engine (10) of claim 1, further comprising:
de_de: 2. Gasturbinentriebwerk (10) nach Anspruch 1, ferner umfassend:

source: a first tower shaft (222) extending radially outward from the first shaft (28), wherein the first spool (16) is rotationally coupled to the first gearing (224, 226) via the first tower shaft (222); and
de_de: eine erste Turmwelle (222), die sich radial von der ersten Welle (28) nach außen erstreckt, wobei die erste Spule (16) über die erste Turmwelle (222) drehfest mit dem ersten Getriebe (224, 226) verbunden ist; und

source: a second tower shaft (208) extending radially outward from the third shaft (22), wherein the third spool (14) is rotationally coupled to the second gearing (210, 212) via the second tower shaft (208).
de_de: eine zweite Turmwelle (208), die sich radial von der dritten Welle (22) nach außen erstreckt, wobei die dritte Spule (14) über die zweite Turmwelle (208) drehfest mit dem zweiten Getriebe (210, 212) gekoppelt ist.

source: 3. The gas turbine engine (10) of claim 2, further comprising:
de_de: 3. Gasturbinentriebwerk (10) nach Anspruch 2, ferner umfassend:

source: a clutch (216) disposed between the second gearing (210, 212) and the second spool (12), wherein the clutch (216) includes a disengaged state whereby the second spool (12) is uncoupled from the second tower shaft (208), and wherein the clutch (216) includes an engaged state whereby the second spool (12) is coupled to the second tower shaft (208).
de_de: eine Kupplung (216), die zwischen dem zweiten Getriebe (210, 212) und der zweiten Spule (12) angeordnet ist, wobei die Kupplung (216) einen ausgekuppelten Zustand aufweist, in dem die zweite Spule (12) von der zweiten Turmwelle (208) abgekoppelt ist, und wobei die Kupplung (216) einen eingekuppelten Zustand aufweist, in dem die zweite Spule (12) mit der zweiten Turmwelle (208) gekoppelt ist.

source: 4. The gas turbine engine (10) of any preceding claim, wherein the housing (230) of the accessory gearbox (232) subtends the gas turbine engine (10) about the first spool (16) or the third spool (14).
de_de: 4. Gasturbinentriebwerk (10) nach einem der vorhergehenden Ansprüche, wobei das Gehäuse (230) des Nebengetriebes (232) das Gasturbinentriebwerk (10) um die erste Spule (16) oder die dritte Spule (14) herum begrenzt.

source: 5. The gas turbine engine (10) of any preceding claim, wherein the first tower shaft (222) and the second tower shaft (208) are angularly spaced about the centerlines of the first spool (16) and the third spool (14).
de_de: 5. Gasturbinentriebwerk (10) nach einem der vorhergehenden Ansprüche, wobei die erste Turmwelle (222) und die zweite Turmwelle (208) um die Mittellinien der ersten Spule (16) und der dritten Spule (14) winkelmäßig beabstandet sind.

source: 6. The gas turbine engine (10) of any preceding claim, wherein the second shaft (76) is offset from the first shaft (28) and the third shaft (22), and the first shaft (28) is concentric with the third shaft (22).
de_de: 6. Gasturbinentriebwerk (10) nach einem der vorhergehenden Ansprüche, wobei die zweite Welle (76) gegenüber der ersten Welle (28) und der dritten Welle (22) versetzt ist und die erste Welle (28) konzentrisch zu der dritten Welle (22) ist.

source: 7. The gas turbine engine (10) of any preceding claim, further comprising:
de_de: 7. Gasturbinentriebwerk (10) nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: a primary combustor (70) communicating with the first compressor (24) and the first turbine (26); and
de_de: eine primäre Brennkammer (70), die mit dem ersten Verdichter (24) und der ersten Turbine (26) in Verbindung steht; und

source: a secondary combustor (84) communicating with the second compressor (74) and the second turbine (82).
de_de: eine sekundäre Brennkammer (84), die mit dem zweiten Verdichter (74) und der zweiten Turbine (82) in Verbindung steht.

source: 8. The gas turbine engine (10) of claim 7, wherein a primary flow path (58) includes, in flow series, the third compressor (18), the first compressor (24), the primary combustor (70), the first turbine (26), and the third turbine (20), a secondary flow path (94) includes, in flow series, the second compressor (74), the secondary combustor (84), and the second turbine (82), and the secondary flow path (94) intersects the primary flow path (58) between the first compressor (24) and the primary combustor (70).
de_de: 8. Gasturbinentriebwerk (10) nach Anspruch 7, wobei ein primärer Strömungsweg (58) in Strömungsreihe den dritten Verdichter (18), den ersten Verdichter (24), die primäre Brennkammer (70), die erste Turbine (26) und die dritte Turbine (20) aufweist, ein sekundärer Strömungsweg (94) in Strömungsreihe den zweiten Verdichter (74), die sekundäre Brennkammer (84) und die zweite Turbine (82) aufweist und der sekundäre Strömungsweg (94) den primären Strömungsweg (58) zwischen dem ersten Verdichter (24) und der primären Brennkammer (70) kreuzt.

source: 9. The gas turbine engine (10) of any preceding claim, wherein:
de_de: 9. Gasturbinentriebwerk (10) nach einem der vorhergehenden Ansprüche, wobei:

source: the first compressor (24) is a high pressure compressor (24) and the third compressor (18) is a low pressure compressor (18), and the first turbine (26) is a high pressure turbine (26) and the third turbine (20) is a low pressure turbine (20); and/or
de_de: der erste Verdichter (24) ein Hochdruckverdichter (24) und der dritte Verdichter (18) ein Niederdruckverdichter (18) ist, und wobei die erste Turbine (26) eine Hochdruckturbine (26) und die dritte Turbine (20) eine Niederdruckturbine (20) ist; und/oder

source: a second maximum speed is the maximum continuous rotational speed of the second spool (12), a third maximum speed is the maximum continuous rotational speed of the third spool (14), and a gear ratio of the second gearing (210, 212) is constant and rotates the second spool (12) at the second maximum speed when a third rotational speed of the third spool (14) is equal to or less than 90% of the third maximum speed and greater than or equal to 80% of the third maximum speed.
de_de: eine zweite maximale Geschwindigkeit eine maximale Dauerrotationsgeschwindigkeit der zweiten Läufergruppe (12) ist, die dritte maximale Geschwindigkeit eine maximale Dauerrotationsgeschwindigkeit der dritten Läufergruppe (14) ist und ein Übersetzungsverhältnis des zweiten Getriebes (210, 212) konstant ist und die zweite Läufergruppe (12) dann mit einer zweiten maximalen Geschwindigkeit dreht, wenn eine dritte Rotationsgeschwindigkeit der dritten Läufergruppe (14) gleich oder geringer als 90 % der dritten maximalen Geschwindigkeit und größer als oder gleich 80 % der dritten maximalen Geschwindigkeit ist.

source: The gas turbine engine (10) of any preceding claim, further comprising:
de_de: Gasturbinentriebwerk (10) nach einem der vorhergehenden Ansprüche, ferner umfassend:

source: a diffuser (68) disposed between and fluidly communicating with the first compressor (24) and the primary combustor (70); and
de_de: einen Diffusor (68), der zwischen dem ersten Verdichter (24) und der primären Brennkammer (70) angeordnet ist und mit diesen in Fluidverbindung steht; und

source: an outlet duct assembly (80) fluidly connecting the second turbine (82) to the diffuser (68) and the primary combustor (70), optionally wherein the outlet duct assembly (80) comprises:
de_de: eine Auslasskanalanordnung (80), die die zweite Turbine (82) mit dem Diffusor (68) und der primären Brennkammer (70) fluidverbindet, wobei die Auslasskanalanordnung (80) optional umfasst:

source: a main duct (114) extending from and communicating with the second turbine (82);
de_de: einen Hauptkanal (114), der sich von der zweiten Turbine (82) erstreckt und mit dieser in Verbindung steht;

source: a plurality of first branch ducts (116) extending from and communicating between the main duct (114) to the diffuser (68); and
de_de: eine Vielzahl von ersten Zweigkanälen (116), die sich von dem Hauptkanal (114) zu dem Diffusor (68) erstreckt und eine Verbindung zwischen diesen herstellt; und

source: a second branch duct (118) extending from and communicating between the main duct (114) to the primary combustor (70).
de_de: einen zweiten Zweigkanal (118), der sich von dem Hauptkanal (114) zu der primären Brennkammer (70) erstreckt und eine Verbindung zwischen diesen herstellt.

source: A method of operating a gas turbine engine (10) having an operational power range that includes an intermediate power range between a maximum continuous power and a minimum continuous power, the method comprising supplying a first fuel flow (58) rate to a primary combustor (70) of the gas turbine engine (10) contemporaneously with supplying a second fuel flow (58) rate to a secondary combustor (84) of the gas turbine engine (10) based on a power lever angle indicative of the intermediate power range, wherein:
de_de: Verfahren zum Betreiben eines Gasturbinentriebwerks (10) mit einem Betriebsleistungsbereich, der einen mittleren Leistungsbereich zwischen einer maximalen Dauerleistung und einer minimalen Dauerleistung aufweist, wobei das Verfahren das Zuführen einer ersten Rate einer Brennstoffströmung (58) zu einer primären Brennkammer (70) des Gasturbinentriebwerks (10) und das gleichzeitige Zuführen einer zweiten Rate einer Brennstoffströmung (58) zu einer sekundären Brennkammer (84) des Gasturbinentriebwerks (10) auf der Grundlage eines Leistungshebelwinkels umfasst, der den mittleren Leistungsbereich angibt, wobei:

source: the first fuel flow (58) rate varies to maintain a minimum exhaust pressure ratio of the gas turbine engine (10);
de_de: die erste Rate der Brennstoffströmung (58) derart variiert, dass ein minimales Abgasdruckverhältnis des Gasturbinentriebwerks (10) aufrechterhalten wird;

source: the second fuel flow (58) rate varies based on a power lever angle greater than loiter power and less than or equal to cruise power;
de_de: die zweite Rate der Brennstoffströmung (58) variiert auf der Grundlage eines Leistungshebelwinkel, der größer als die Loiter-Leistung und kleiner oder gleich der Reiseleistung ist;

source: the primary combustor (70) is disposed between a first compressor (24) and a first turbine (26) and fluidly communicates with the first compressor (24) and the first turbine (26);
de_de: die primäre Brennkammer (70) zwischen einem ersten Verdichter (24) und einer ersten Turbine (26) angeordnet ist und mit dem ersten Verdichter (24) und der ersten Turbine (26) in Fluidverbindung steht;

source: the secondary combustor (84) is disposed between a second compressor (74) and a second turbine (82) and fluidly communicates with the second compressor (74) and the second turbine (82);
de_de: die sekundäre Brennkammer (84) zwischen dem zweiten Verdichter (74) und der zweiten Turbine (82) angeordnet ist und mit dem zweiten Verdichter (74) und der zweiten Turbine (82) in Fluidverbindung steht;

source: the first compressor (24) and the first turbine (26) are mounted to a first shaft (28) to define a first spool (16) of the gas turbine engine (10);
de_de: der erste Verdichter (24) und die erste Turbine (26) an einer ersten Welle (28) montiert sind, um eine erste Läufergruppe (16) des Gasturbinentriebwerks (10) zu definieren;

source: the second compressor (74) and the second turbine (82) are mounted to a second shaft (76) to define a second spool (12) of the gas turbine engine (10);
de_de: der zweite Verdichter (74) und die zweite Turbine (82) an einer zweiten Welle (76) montiert sind, um eine zweite Läufergruppe (12) des Gasturbinentriebwerks (10) zu definieren;

source: the second shaft (76) is eccentric to the first shaft (28);
de_de: die zweite Welle (76) exzentrisch zu der ersten Welle (28) ist;

source: a third spool (14) comprises a third compressor (18) and a third turbine (20) mounted to a third shaft (22);
de_de: eine dritte Läufergruppe (14) einen dritten Verdichter (18) und eine dritte Turbine (20) umfasst und an einer dritten Welle (22) montiert ist;

source: an accessory gearbox (232) comprises a first gearing (224, 226) and a second gearing (210, 212) enclosed within a housing (230), wherein the first gearing (224, 226) rotates independently of the second gearing (210, 212); and
de_de: ein Nebengetriebe (232) ein erstes Getriebe (224, 226) und ein zweites Getriebe (210, 212) umfasst, die in einem Gehäuse (230) eingeschlossen sind, wobei sich das erste Getriebe (224, 226) unabhängig vom zweiten Getriebe (210, 212) dreht; und

source: the first spool (16) is rotationally coupled to a plurality of engine accessories via the first gearing (224, 226), and the third spool (14) is rotationally coupled to the second spool (12) via the second gearing (210, 212).
de_de: die erste Läufergruppe (16) über das erste Getriebe (224, 226) drehfest mit der Vielzahl von Triebwerkzubehörteilen gekoppelt ist und die dritte Läufergruppe (14) über das zweite Getriebe (210, 212) drehfest mit der zweiten Läufergruppe (12) gekoppelt ist.

source: The method of claim 11, further comprising:
de_de: Verfahren nach Anspruch 11, ferner umfassend:

source: increasing an open area of a variable area turbine (38) based on the power lever angle indicative of the intermediate power range, wherein the variable turbine vane is disposed between the first turbine (26) and the second turbine (82); and/or
de_de: Vergrößern einer offenen Fläche einer Turbine (38) mit variabler Fläche auf Grundlage des Leistungshebelwinkels, der den mittleren Leistungsbereich angibt, wobei die variable Turbinenleitschaufel zwischen der ersten Turbine (26) und der zweiten Turbine (82) angeordnet ist; und/oder

source: decreasing the open area of the variable turbine (82) vane based on the power lever angle indicative of a power level exclusive of the intermediate power range.
de_de: Verkleinern der offenen Fläche der variablen Turbinenschaufel (82) auf der Grundlage des Leistungshebelwinkels, der ein Leistungsniveau anzeigt, das den mittleren Leistungsbereich ausschließt.

source: The method of claim 11 or 12, further comprising:
de_de: Verfahren nach Anspruch 11 oder 12, ferner umfassend:

source: engaging a clutch (216) disposed between the second shaft (76) and a third shaft (22) based on the power lever angle indicative of the intermediate power range, wherein the third shaft (22) is concentric with the first shaft (28), and engaging the clutch (216) rotationally couples the second shaft (76) and the third shaft (22); and/or
de_de: Einkuppeln einer Kupplung (216), die zwischen der zweiten Welle (76) und einer dritten Welle (22) angeordnet ist, auf der Grundlage des Leistungshebelwinkels, der den mittleren Leistungsbereich anzeigt, wobei die dritte Welle (22) konzentrisch zu der ersten Welle (28) ist und durch das Einkuppeln der Kupplung (216) die zweite Welle (76) und die dritte Welle (22) drehgekoppelt werden; und/oder

source: disengaging the clutch (216) based on the power lever angle indictive of a power level exclusive of the intermediate power range, wherein disengaging the clutch (216) rotationally uncouples the second shaft (76) and the third shaft (22).
de_de: Auskuppeln der Kupplung (216) auf der Grundlage des Leistungshebelwinkels, der ein Leistungsniveau angibt, das den mittleren Leistungsbereichs ausschließt, wobei das Auskuppeln der Kupplung (216) die zweite Welle (76) und die dritte Welle (22) drehmäßig entkoppelt.

source: The method of any of claims 11 to 13, further comprising supplying a third fuel flow (58) rate to a primary combustor (70) contemporaneously with stopping fuel flow (58) to the secondary combustor (84) based on a power lever angle indicative of a power level exclusive of the intermediate power range.
de_de: Verfahren nach einem der Ansprüche 11 bis 13, das ferner das Zuführen einer dritten Rate der Brennstoffströmung (58) zu einer primären Brennkammer (70) mit gleichzeitigem Stoppen der Brennstoffströmung (58) zu der sekundären Brennkammer (84) umfasst, auf der Grundlage eines Leistungshebelwinkels, der ein Leistungsniveau angibt, das den mittleren Leistungsbereichs ausschließt.

source: The method of claim 14, wherein the third fuel flow (58) rate varies based on the power lever angle.
de_de: Verfahren nach Anspruch 14, wobei die dritte Rate der Brennstoffströmung (58) auf der Grundlage des Leistungshebelwinkels variiert.

source: 1. A divan for an aircraft side-facing seat, the divan comprising:
de_de: 1. Diwan für einen seitwärtsgerichteten Flugzeugsitz, wobei der Diwan Folgendes umfasst:

source: a divan seat frame (104), the divan seat frame including a backrest frame (106) and a seat pan frame, the backrest frame including a first backrest frame portion and a second backrest frame portion, the seat pan frame including a first seat pan frame portion (110) and a second seat pan frame portion (112), the first backrest frame portion configured to actuate independently from the second backrest frame portion, the first seat pan frame portion configured to actuate independently from the second seat pan frame portion via a seat pan tracking assembly;
de_de: einen Diwan-Sitzrahmen (104), wobei der Diwan-Sitzrahmen einen Rückenlehnenrahmen (106) und einen Sitzflächenrahmen aufweist, wobei der Rückenlehnenrahmen einen ersten Rückenlehnenrahmenabschnitt und einen zweiten Rückenlehnenrahmenabschnitt aufweist, wobei der Sitzflächenrahmen einen ersten Sitzflächenrahmenabschnitt (110) und einen zweiten Sitzflächenrahmenabschnitt (112) aufweist, wobei der erste Rückenlehnenrahmenabschnitt konfiguriert ist, um unabhängig von dem zweiten Rückenlehnenrahmenabschnitt betätigbar zu sein, wobei der erste Sitzflächenrahmenabschnitt konfiguriert ist, um über eine Sitzflächenverstellbaugruppe unabhängig von dem zweiten Sitzflächenrahmenabschnitt betätigbar zu sein;

source: a storage compartment (134) positioned underneath the seat pan frame, the storage compartment including one or more sidewalls (135) defining a cavity (133) for stowage, the storage comparting including an opening (125) configured to provide a passenger access to the cavity; and
de_de: ein Staufach (134), das unterhalb des Sitzflächenrahmen positioniert ist, wobei das Staufach eine oder mehrere Seitenwände (135) aufweist, die einen Hohlraum (133) zum Verstauen definieren, wobei das Staufach eine Öffnung (125) aufweist, die konfiguriert ist, um einem Passagier Zugang zu dem Hohlraum bereitzustellen; und

source: a legrest assembly (102), the legrest assembly comprising:
de_de: eine Beinauflagenbaugruppe (102), wobei die Beinauflagenbaugruppe Folgendes umfasst:

source: a plurality of frame members (120), at least one frame member of the plurality of frame members configured to be coupled to a portion of the seat pan frame;
de_de: eine Vielzahl von Rahmenelementen (120), wobei mindestens ein Rahmenelement der Vielzahl von Rahmenelementen konfiguriert ist, um mit einem Abschnitt des Sitzflächenrahmens gekoppelt zu sein;

source: one or more closeout panels (137a, 137b) configured to be arranged proximate to the opening within the storage compartment, the one or more closeout panels configured to at least partially form the opening within the storage compartment and at least partially enclose one or more gaps formed between the one or more sidewalls of the storage compartment, the plurality of frame members, and one or more portions of the divan seat frame;
de_de: eine oder mehrere Verkleinungspaneele (137a, 137b), die konfiguriert sind, um in der Nähe der Öffnung innerhalb des Staufach angeordnet zu sein, wobei die eine oder die mehreren Verkleinungspaneele konfiguriert sind, um die Öffnung in dem Staufach mindestens teilweise auszubilden und einen oder mehrere Spalte, die zwischen der einen oder den mehreren Seitenwänden des Staufachs ausgebildet sind, die Vielzahl von Rahmenelementen und einen oder mehrere Abschnitte des Divan-Sitzrahmens mindestens teilweise zu umschließen;

source: a plurality of panel doors (122), the plurality of panel doors configured to at least one of open or close, the plurality of panel doors including a plurality of integrated frame members configured to couple the plurality of doors to at least one frame member of the plurality of frame members; and
de_de: eine Vielzahl von Paneeltüren (122), wobei die Vielzahl von Paneeltüren konfiguriert ist, um sich zu öffnen und/oder zu schließen, wobei die Vielzahl von Paneeltüren eine Vielzahl von einstückigen Rahmenelementen aufweist, die konfiguriert sind, um die Vielzahl von Türen mit mindestens einem Rahmenelement der Vielzahl von Rahmenelementen zu koppeln; und

source: a panel door latch mechanism configured to open the plurality of panel doors, the panel door latch mechanism including a door handle and a panel door latch assembly.
de_de: einen Paneeltür-Verschlussmechanismus, der konfiguriert ist, um die Vielzahl von Paneeltüren zu öffnen, wobei der Paneeltür-Verschlussmechanismus einen Türgriff und eine Paneeltür-Verschlussbaugruppe aufweist.

source: 2. The divan of Claim 1, wherein the storage compartment includes an access door (136) configured to at least partially enclose the opening of the storage compartment.
de_de: 2. Diwan nach Anspruch 1, wobei das Staufach eine Zugangstür (136) aufweist, die konfiguriert ist, um die Öffnung des Staufachs mindestens teilweise zu umschließen.

source: 3. The divan of Claim 1 or 2, wherein the storage compartment includes a mesh liner (140) configured to couple to a portion of the one or more sidewalls to secure one or more stowage items to the portion of the one or more sidewalls.
de_de: 3. Diwan nach Anspruch 1 oder 2, wobei das Staufach eine Netzauskleidung (140) aufweist, die konfiguriert ist, um mit einem Abschnitt der einen oder mehreren Seitenwände gekoppelt zu werden, um einen oder mehrere Verstaugegenstände an dem Abschnitt der einen oder mehreren Seitenwände zu sichern.
